print("================================================")
print("Спецсимволы")
print("================================================")
print("1. Перевод строки")
text = "Hello\nPython" # \n спецсимвол новой строки
print(text)
print("================================================")
print("2. Горизонтальная табуляция")
t = "Python\tAutomation" # \t добавляет большой пробел Python	Automation
print(t)
print("================================================")
print("3. Экранирование символов")
path = "C:\new\test.txt" # отработали спец символы \n и \t
print(path)
path2 = "C:\\new\\test.txt"
print(path2)
text2 = "Марка вина \"Ягодка\""
print(text2)
text3 = "Марка вина 'Ягодка'"
print(text3)
print("================================================")
print("4. Сырые (raw) строки")
path3 = r"C:\new\test.txt" # при добавлении r мы можем писать одну \
print(path3)
print("================================================")
print("5. Использование разных спецсимволов")
s = "Hello\b World" # символ \b он похоже встает вместо буквы за которой он написан и пропускает ее
print(s)
z = "Nikolay Worl\bd"
print(z)
x= "Hello\fPython"
print(x)
print("================================================")
