print("================================================")
print("Задачи по теме 'Генераторы списков (List Comprehensions)'")
print("================================================")
print("1. Создайте список из квадратов чисел от 1 до N, используя list comprehension.")
print("================================================")
# N = 10
# result = [num ** 2 for num in range(1, N + 1)]
# print(result)

print("================================================")
print("2. Сформируйте список, содержащий только четные числа в диапазоне от -10 до 10.")
res = [i for i in range(-10, 11 ) if i % 2 == 0]
print(res)
print("================================================")
print("3. Дан список слов. Создайте новый список, содержащий длины всех слов, используя генератор списков")

words = ["Привет", "Николай!", "Как", "Дела?"]
lengths = [len(word) for word in words]
print(lengths)

print("================================================")
print("4. Создайте список из чисел от 1 до 20, где вместо четных чисел будет 'четное', а вместо нечетных —")
numbers = ["Четное" if x % 2 == 0 else "Нечетное" for x in range(1, 21)]
print(numbers)

print("================================================")
print("5. Проверка, является ли объект итерируемым")

lis_1 = [
    42,
    "Привет ",
    [10, 20, 30]
]
res = [hasattr(obj, '__iter__') for obj in lis_1]
print(res)
print("================================================")
