print("================================================")
print("Задачи по уроку 'Операторы break, continue и else в цикле while'")
print("================================================")
print("1. Поиск первого четного числа")
# numbers = [23, 43, 75, 33, 82, 51, 61]
# i =0
# num = 0
# while i < len(numbers):
#     if numbers[i] % 2 == 0:
#         print("Первое четное число равно: ", numbers[i])
#         break
#     i += 1
# else:
#     print("Число не найдено ")
print("================================================")
print("2. Пропуск отрицательных чисел")
print("Вводите числа. Для завершения введите 0.")

# total = 0
# while True:
#     number = int(input("Введите число: "))
#     if number == 0:
#         break
#     if number < 0:
#         print(f"Число {number} отрицательное - пропускаем")
#         continue
#     total += number
# print(total)
print("================================================")
print("3. Вывод нечетных чисел из диапазона")
# a = int(input("Введите число: "))
# b = int(input("Введите число: "))
# current = a
# while current <= b:
#     if current % 2 == 0:
#         current += 1
#         continue
#     print(current)
#     current += 1
print("================================================")
print("4. Проверка на простое число")
# n = int(input("Введите число n: "))
# if n < 2:
#     print("Число должно быть больше 1")
# else:
#     i = 2
#     while i < n:
#         if n % i == 0:
#             print(f"{n} делится на {i}, значит, оно не простое число.")
#             break
#         i += 1
#     else:
#         print("Число простое")
print("================================================")
print("5. Поиск максимального числа")
num = 1
res_sum = []

while num != 0:
    num = input("Введите целое число или 0 для выхода: ")
    if num == "":
        print("Введено пустое значение. Выход из программы.")
        break
    num = int(num)
    if num != 0:
        res_sum.append(num)
if res_sum:
    print("Наибольшее введённое число:", max(res_sum))
print("================================================")


