# a = 0
# b = 888888881
# c = -3
# d = -345678
#
# # Вещественные числа
# a1 = 4.5
# b1 = 4.512345
# c1 = -68833.512345

"""
float - вещественные числа - 3.5, 6.789
int - целочисленные значения - 2, -987, 1234567
"""

# a = 2 + 3.5
#
# a = 8 / 2
# b = 3 / 6
#
# print(type(a))
# print(a)
# print(b)

# a = -7 // 2
#
# print(a)

# a = 4 * 2
# print(a)

# a = 123 % 10
# print(a)

# print(9 % 5) # 9 - 5 = 4
# print(-9 % 5) # наименьшее число которое делится на цело -10, -9 - (-10) = 1
# print(9 % -5) # 9 - 10 = -1
# print(-9 % -5) # -9 - (-5) = -4

# a = 2 ** 3 # 2 * 2 * 2
# print(a)

# a = 2 + 4 * 7
# print(a)

a = 1
a /= 10 # a = a + 1

print(a)