print("================================================")
print("Вложенные условия и elif")
print("================================================")
print("1. Проверка оценки")
# item = int(input("Введите оценку (1-5): "))
# if item == 1 or item == 2:
#     print("Неудовлетворительно")
# elif item == 3:
#     print("Удовлетворительно")
# elif item == 4:
#     print("Хорошо")
# elif item == 5:
#     print("Отлично!")
# else:
#     print("Некорректная оценка")
print("================================================")
print("2. Определение времени суток по часам")
# time = int(input("Введите ваше время (0-23): "))
# if 6 <= time <= 11:
#     print("Утро")
# elif 12 <= time <= 17:
#     print("День")
# elif 18 <= time <= 21:
#     print("Вечер")
# elif time >= 22 or time <= 5:
#     print("Ночь")
# else:
#     print("Некорректное время")
print("================================================")
print("3. Классификация температуры")
# temp = float(input("Введите температуру: "))
# if temp <= -10:
#     print("Очень холодно")
# elif -10 <= temp <= 0:
#     print("Холодно")
# elif 1 <= temp <= 10:
#     print("Прохладно")
# elif 10 <= temp <= 25:
#     print("Тепло")
# elif temp >= 25:
#     print("Жарко")
print("================================================")
print("4. Проверка года на високосность")
# year = int(input("Введите год в формате хххх: "))
# if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
#     print("Год високосный")
# else:
#     print("Год не високосный")
print("================================================")
print("5. Калькулятор двух чисел")
x = float(input("Введите число x: "))
y = float(input("Введите число y: "))
sign = input("Введите операцию (+, -, *, /)")
if sign == "+":
    print(x+y)
elif sign == "-":
    print(x-y)
elif sign == "*":
    print(x*y)
elif sign == "/":
    if y != 0:
        print(x/y)
    else:
        print("Ошибка: деление на ноль!")
else:
    print("Некорректная операция")



print("================================================")



print("================================================")