print("================================================")
print("Условный оператор")
print("================================================")
print("1. Проверка знака числа")
# x = int(input("Введите любое число: "))
#
# if x > 0:
#     print("Число положительное")
# if x < 0:
#     print("Число отрицательное")
# else:
#     print("Число равно нулю")
print("================================================")
print("2. Проверка на четность")
# x = int(input("Введите целое число: "))
# if x % 2 == 0:
#     print("Число четное")
# else:
#     print("Число нечетное")
print("================================================")
print("3. Определение диапазона")
# x = int(input("Введите целое число: "))
# if 1 <= x <= 10:
#     print("Число в диапазоне")
# else:
#     print("Число вне диапазона")
print("================================================")
print("4. Перестановка двух чисел")
# a = int(input("Введите целое число: "))
# b = int(input("Введите целое число: "))
#
# if a < b:
#     a, b = b, a
#     print("Обмен произошел ")
# else:
#     print("Обмен не требуется ")
#     print(a, b)
print("================================================")
print("5. Поиск минимума из двух чисел")
# a = int(input("Введите целое число: "))
# b = int(input("Введите целое число: "))
# if a > b:
#     print(b)
# else:
#     print(a)
print("================================================")
print("6. Проверка наличия элемента в списке")
# marks = [3, 4, 5, 2, 5, 4]
# # if marks ==2:
# if 2 in marks:
#     print("Есть неудовлетворительная оценка")
# else:
#     print("Все оценки положительные")
print("================================================")
print("7. Проверка делимости")
# x = int(input("Введите целое число: "))
# if x % 3 == 0 and x % 5 == 0:
#     print("Число делится на 3 и 5")
# elif x % 3 == 0:
#     print("Число делится только на 3")
# elif x % 5 == 0:
#     print("Число делится только на 5")
# else:
#     print("Число не делится на 3 и 5")
print("================================================")
print("8. Оператор in для проверки пароля")
# password = input("Введите пароль: ")
# if password == "admin123" :
#     print("Доступ разрешен")
# else:
#     print("Доступ запрещен")
print("================================================")
print("9. Калькулятор скидки")
# amount = int(input("Введите сумму покупки: "))
# discount = 0.00
# if amount >= 5000:
#     discount = 0.10
#     print("Скидка 10% ")
# else:
#     if  1000 <= amount < 5000:
#         discount = 0.05
#         print("Скидка 5% ")
#     else:
#         print(amount)
# final_amount = amount * (1 - discount)
# print(final_amount)
print("================================================")
print("10. Определение високосного года")
# year = int(input("Введите год в формате хххх: "))
# if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
#     print("Год високосный")
# else:
#     print("Год не високосный")
print("================================================")