print("================================================")
print("Тернарный оператор")
print("================================================")
print("1. Проверка четности числа")
# x = int(input("Введите число: "))
# res = "Число четное" if x % 2 == 0 else "Число не четное"
# print(res)
print("================================================")
print("2. Определение наибольшего числа")

print("================================================")
# x = int(input("Введите число: "))
# y = int(input("Введите число: "))
#
# res = x if x > y else y
# print(res)

print("================================================")
print("3. Проверка положительного или отрицательного числа")
# x = int(input("Введите число: "))
# res =  "Число положительное" if x > 0 else "Число отрицательное" if x < 0 else "Число равно нулю"
# print(res)
print("================================================")
print("4. Определение возраста для входа в клуб")
# x = int(input("Введите ваш возраст: "))
# res = "Вход разрешен" if x>=18 else "Вход запрещен"
# print(res)
print("================================================")
print("5. Определение скидки в магазине")
x = int(input("Введите сумму ваших покупок: "))
res = x * 0.9 if x >= 5000 else x
print(res)
print("================================================")